Rails/app/controllers/games_controller.rb

  def get_board_game_geek_data
    search_term = params[:search_term]
    game_list = get_game_list(search_term)

    new_games_count = 0
    game_list["boardgames"]["boardgame"].each do |game|
      game_hash = get_game_info(game["objectid"])
      game_record = Game.new(game_hash)

      sleep 0.5
      new_games_count += 1 if game_record.save
---
SELECT "games".* FROM "games"
INSERT INTO "games" ("bggID", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["bggID", "90100"], ["created_at", "2015-02-15 06:46:52.022573"], ["title", "Die Pioniere (fan expansion for The Settlers of Catan)"], ["updated_at", "2015-02-15 06:46:52.022573"]]